Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.Split Method
 Returns the resulting geometry or geometries when a section and the related automatically created sections are removed from this geometry.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IList<ConnectiveGeometry> Split(
	ConnectiveGeometry geometry,
	GeometrySection geometrySection
)
Public Function Split (
	geometry As ConnectiveGeometry,
	geometrySection As GeometrySection
) As IList(Of ConnectiveGeometry)
Parameters
geometry
Type: Tekla.Structures.Model.ConnectiveGeometry
ConnectiveGeometry used for split operation.
geometrySection
Type: Tekla.Structures.Model.GeometrySection
GeometrySection to remove.
Return Value
Type: IList<ConnectiveGeometry>
The resulting geometries once the section and related automatic sections are removed.
Exceptions
Exception | Condition
ArgumentException | Thrown when the supplied geometrySection is invalid or geometry is a stand-alone bend geometry, meaning that the first GeometrySection is a BendSurfaceNode.
See Also
Reference
BentPlateGeometrySolver Class
Tekla.Structures.Model Namespace